<template>
  <div class="about-me-view">
    <h2>欢迎使用，每周陆续上线更多功能……</h2>
    <ul>
      <li>
        <h3>使用方法：</h3>
        <ol>
          <li>
            <p>打开软件，客户端在线时，左上角显示彩色（<img src="@/assets/img/lol-colored.png" alt="" />）图标。</p>
          </li>
          <li>
            <p>并会显示一个状态小窗口（暂时没有功能）。</p>
          </li>
        </ol>
      </li>
      <li>
        <h3>功能(目前仅有1个)：</h3>
        <ol>
          <li>
            <p>在【选择英雄】阶段自动发送队友战绩到聊天框。</p>
          </li>
        </ol>
      </li>
      <li>
        <h3>会不会封号？</h3>
        <h4>不会。（本程序符合【腾讯游戏绿色插件公约】）</h4>
      </li>
      <li>
        <h3>无法使用？</h3>
        <ol>
          <li>
            <h4>Q：客户端已经打开，无法检测到怎么办</h4>
            <p>A：尝试【以管理员身份运行】，并添加到杀毒白名单内</p>
          </li>
          <li>
            <h4>Q：杀毒报错怎么办</h4>
            <p>A：本软件开源，不会有任何病毒，请允许操作以致可以正常使用</p>
          </li>
          <li>
            <h4>Q：网吧无法使用？</h4>
            <p>A：目前每周更新，暂未在网吧测试，如有问题请请我们反馈并等待后续版本</p>
          </li>
        </ol>
      </li>
      <li>
        <h3>备注：</h3>
        <ol>
          <li>查询战绩可能有点不稳定，小几率失败（没有任何提示）；可尝试【重启客户端】并点击客户端[生涯]的[历史战绩]，查看是否正常显示（毕竟是调用客户端接口）。</li>
        </ol>
      </li>
    </ul>
    <h3>为了美好的明天而战 ——杰斯</h3>
  </div>
</template>

<script lang="ts" setup></script>

<style lang="scss"></style>
