<template>
  <div class="overview-view">
    <p>欢迎使用，临近开学，时间紧迫，0.0.1 版本暂时仅有【发送队友战绩】（自动发送到聊天框）功能，每周陆续上线更多功能</p>
    <p>
      使用方法：打开本软件会自动检测游戏状态，客户端在线时，左上角LOL会变成彩色（<img
        src="@/assets/img/lol-colored.png"
        alt=""
      />），并会显示一个小窗口（暂时没有功能），之后会在【选择英雄】时自动【发送队友战绩】
    </p>
    <p>查询战绩可能有点不稳定，小几率失败（没有任何提示），希望你不会中奖...，可尝试重启客户端并点击客户端生涯历史战绩，查看是否正常显示，毕竟是调用客户端接口</p>
    <p>如果客户端启动，图标没有变色，请尝试管理员身份运行本软件，因为国服客户端以管理员身份运行，如果本程序不以管理员身份运行就无法获取到客户端信息。</p>
    <p>为了美好的明天而战 ——杰斯</p>
  </div>
</template>

<script lang="ts" setup></script>

<style lang="scss"></style>
